MikroElektronika/core_packages/PIC/XC8/def/PIC18F4680/mcu.h
extern volatile RXB0CONbits_t RXB0CONbits __at(0xF60);
// bitfield macros
#define _RXB0CON_FILHIT0_POSN                               0x0
#define _RXB0CON_FILHIT0_POSITION                           0x0
#define _RXB0CON_FILHIT0_SIZE                               0x1
#define _RXB0CON_FILHIT0_LENGTH                             0x1
#define _RXB0CON_FILHIT0_MASK                               0x1
#define _RXB0CON_JTOFF_FILHIT1_POSN                         0x1
#define _RXB0CON_JTOFF_FILHIT1_POSITION                     0x1
#define _RXB0CON_JTOFF_FILHIT1_SIZE                         0x1
#define _RXB0CON_JTOFF_FILHIT1_LENGTH                       0x1
#define _RXB0CON_JTOFF_FILHIT1_MASK                         0x2
#define _RXB0CON_RXB0DBEN_FILHIT2_POSN                      0x2
#define _RXB0CON_RXB0DBEN_FILHIT2_POSITION                  0x2
#define _RXB0CON_RXB0DBEN_FILHIT2_SIZE                      0x1
#define _RXB0CON_RXB0DBEN_FILHIT2_LENGTH                    0x1
#define _RXB0CON_RXB0DBEN_FILHIT2_MASK                      0x4
#define _RXB0CON_RXRTRRO_FILHIT3_POSN                       0x3
#define _RXB0CON_RXRTRRO_FILHIT3_POSITION                   0x3
#define _RXB0CON_RXRTRRO_FILHIT3_SIZE                       0x1
#define _RXB0CON_RXRTRRO_FILHIT3_LENGTH                     0x1
#define _RXB0CON_RXRTRRO_FILHIT3_MASK                       0x8
#define _RXB0CON_FILHIT4_POSN                               0x4
#define _RXB0CON_FILHIT4_POSITION                           0x4
#define _RXB0CON_FILHIT4_SIZE                               0x1
#define _RXB0CON_FILHIT4_LENGTH                             0x1
#define _RXB0CON_FILHIT4_MASK                               0x10
#define _RXB0CON_RXM0_RTRRO_POSN                            0x5
#define _RXB0CON_RXM0_RTRRO_POSITION                        0x5
#define _RXB0CON_RXM0_RTRRO_SIZE                            0x1
#define _RXB0CON_RXM0_RTRRO_LENGTH                          0x1
#define _RXB0CON_RXM0_RTRRO_MASK                            0x20
#define _RXB0CON_RXM1_POSN                                  0x6
#define _RXB0CON_RXM1_POSITION                              0x6
#define _RXB0CON_RXM1_SIZE                                  0x1
#define _RXB0CON_RXM1_LENGTH                                0x1
#define _RXB0CON_RXM1_MASK                                  0x40
#define _RXB0CON_RXFUL_POSN                                 0x7
#define _RXB0CON_RXFUL_POSITION                             0x7
#define _RXB0CON_RXFUL_SIZE                                 0x1
#define _RXB0CON_RXFUL_LENGTH                               0x1
#define _RXB0CON_RXFUL_MASK                                 0x80
#define _RXB0CON_JTOFF_POSN                                 0x1
#define _RXB0CON_JTOFF_POSITION                             0x1
#define _RXB0CON_JTOFF_SIZE                                 0x1
#define _RXB0CON_JTOFF_LENGTH                               0x1
#define _RXB0CON_JTOFF_MASK                                 0x2
#define _RXB0CON_RXB0DBEN_POSN                              0x2
#define _RXB0CON_RXB0DBEN_POSITION                          0x2
#define _RXB0CON_RXB0DBEN_SIZE                              0x1
#define _RXB0CON_RXB0DBEN_LENGTH                            0x1
#define _RXB0CON_RXB0DBEN_MASK                              0x4
#define _RXB0CON_RXRTRRO_POSN                               0x3
#define _RXB0CON_RXRTRRO_POSITION                           0x3
#define _RXB0CON_RXRTRRO_SIZE                               0x1
#define _RXB0CON_RXRTRRO_LENGTH                             0x1
#define _RXB0CON_RXRTRRO_MASK                               0x8
#define _RXB0CON_RXM0_POSN                                  0x5
#define _RXB0CON_RXM0_POSITION                              0x5
#define _RXB0CON_RXM0_SIZE                                  0x1
#define _RXB0CON_RXM0_LENGTH                                0x1
#define _RXB0CON_RXM0_MASK                                  0x20
#define _RXB0CON_FILHIT1_POSN                               0x1
#define _RXB0CON_FILHIT1_POSITION                           0x1
#define _RXB0CON_FILHIT1_SIZE                               0x1
#define _RXB0CON_FILHIT1_LENGTH                             0x1
#define _RXB0CON_FILHIT1_MASK                               0x2
#define _RXB0CON_FILHIT2_POSN                               0x2
#define _RXB0CON_FILHIT2_POSITION                           0x2
#define _RXB0CON_FILHIT2_SIZE                               0x1
#define _RXB0CON_FILHIT2_LENGTH                             0x1
#define _RXB0CON_FILHIT2_MASK                               0x4
#define _RXB0CON_FILHIT3_POSN                               0x3
#define _RXB0CON_FILHIT3_POSITION                           0x3
#define _RXB0CON_FILHIT3_SIZE                               0x1
#define _RXB0CON_FILHIT3_LENGTH                             0x1
#define _RXB0CON_FILHIT3_MASK                               0x8
#define _RXB0CON_RTRRO_POSN                                 0x5
#define _RXB0CON_RTRRO_POSITION                             0x5
#define _RXB0CON_RTRRO_SIZE                                 0x1
#define _RXB0CON_RTRRO_LENGTH                               0x1
#define _RXB0CON_RTRRO_MASK                                 0x20
#define _RXB0CON_RXBODBEN_POSN                              0x2
#define _RXB0CON_RXBODBEN_POSITION                          0x2
#define _RXB0CON_RXBODBEN_SIZE                              0x1
#define _RXB0CON_RXBODBEN_LENGTH                            0x1
#define _RXB0CON_RXBODBEN_MASK                              0x4
#define _RXB0CON_RXB0FILHIT0_POSN                           0x0
#define _RXB0CON_RXB0FILHIT0_POSITION                       0x0
#define _RXB0CON_RXB0FILHIT0_SIZE                           0x1
#define _RXB0CON_RXB0FILHIT0_LENGTH                         0x1
#define _RXB0CON_RXB0FILHIT0_MASK                           0x1
#define _RXB0CON_RXB0FILHIT1_POSN                           0x1
#define _RXB0CON_RXB0FILHIT1_POSITION                       0x1
#define _RXB0CON_RXB0FILHIT1_SIZE                           0x1
#define _RXB0CON_RXB0FILHIT1_LENGTH                         0x1
#define _RXB0CON_RXB0FILHIT1_MASK                           0x2
#define _RXB0CON_RXB0FILHIT2_POSN                           0x2
#define _RXB0CON_RXB0FILHIT2_POSITION                       0x2
#define _RXB0CON_RXB0FILHIT2_SIZE                           0x1
#define _RXB0CON_RXB0FILHIT2_LENGTH                         0x1
#define _RXB0CON_RXB0FILHIT2_MASK                           0x4
#define _RXB0CON_RXB0FILHIT3_POSN                           0x3
#define _RXB0CON_RXB0FILHIT3_POSITION                       0x3
#define _RXB0CON_RXB0FILHIT3_SIZE                           0x1
#define _RXB0CON_RXB0FILHIT3_LENGTH                         0x1
#define _RXB0CON_RXB0FILHIT3_MASK                           0x8
#define _RXB0CON_RXB0FILHIT4_POSN                           0x4
#define _RXB0CON_RXB0FILHIT4_POSITION                       0x4
#define _RXB0CON_RXB0FILHIT4_SIZE                           0x1
#define _RXB0CON_RXB0FILHIT4_LENGTH                         0x1
#define _RXB0CON_RXB0FILHIT4_MASK                           0x10
#define _RXB0CON_RXB0M0_POSN                                0x5
#define _RXB0CON_RXB0M0_POSITION                            0x5
#define _RXB0CON_RXB0M0_SIZE                                0x1
#define _RXB0CON_RXB0M0_LENGTH                              0x1
#define _RXB0CON_RXB0M0_MASK                                0x20
#define _RXB0CON_RXB0M1_POSN                                0x6
#define _RXB0CON_RXB0M1_POSITION                            0x6
#define _RXB0CON_RXB0M1_SIZE                                0x1
#define _RXB0CON_RXB0M1_LENGTH                              0x1
#define _RXB0CON_RXB0M1_MASK                                0x40
#define _RXB0CON_RXB0FUL_POSN                               0x7
#define _RXB0CON_RXB0FUL_POSITION                           0x7
#define _RXB0CON_RXB0FUL_SIZE                               0x1
#define _RXB0CON_RXB0FUL_LENGTH                             0x1
#define _RXB0CON_RXB0FUL_MASK                               0x80
#define _RXB0CON_RXB0RTRR0_POSN                             0x3
#define _RXB0CON_RXB0RTRR0_POSITION                         0x3
#define _RXB0CON_RXB0RTRR0_SIZE                             0x1
#define _RXB0CON_RXB0RTRR0_LENGTH                           0x1
#define _RXB0CON_RXB0RTRR0_MASK                             0x8
#define _RXB0CON_RXB0RTRRO_POSN                             0x5
#define _RXB0CON_RXB0RTRRO_POSITION                         0x5
#define _RXB0CON_RXB0RTRRO_SIZE                             0x1
#define _RXB0CON_RXB0RTRRO_LENGTH                           0x1
#define _RXB0CON_RXB0RTRRO_MASK                             0x20

// Register: RXB0SIDH
#define RXB0SIDH RXB0SIDH
extern volatile unsigned char           RXB0SIDH            __at(0xF61);
#ifndef _LIB_BUILD
asm("RXB0SIDH equ 0F61h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SID3                   :1;
        unsigned SID4                   :1;
        unsigned SID5                   :1;
        unsigned SID6                   :1;
        unsigned SID7                   :1;
        unsigned SID8                   :1;
        unsigned SID9                   :1;
        unsigned SID10                  :1;
    };
    struct {
        unsigned RXB0SID3               :1;
        unsigned RXB0SID4               :1;
        unsigned RXB0SID5               :1;
        unsigned RXB0SID6               :1;
        unsigned RXB0SID7               :1;
        unsigned RXB0SID8               :1;
        unsigned RXB0SID9               :1;
        unsigned RXB0SID10              :1;
    };
} RXB0SIDHbits_t;
extern volatile RXB0SIDHbits_t RXB0SIDHbits __at(0xF61);
// bitfield macros
#define _RXB0SIDH_SID3_POSN                                 0x0
#define _RXB0SIDH_SID3_POSITION                             0x0
#define _RXB0SIDH_SID3_SIZE                                 0x1
#define _RXB0SIDH_SID3_LENGTH                               0x1
#define _RXB0SIDH_SID3_MASK                                 0x1
#define _RXB0SIDH_SID4_POSN                                 0x1
#define _RXB0SIDH_SID4_POSITION                             0x1
#define _RXB0SIDH_SID4_SIZE                                 0x1
#define _RXB0SIDH_SID4_LENGTH                               0x1
#define _RXB0SIDH_SID4_MASK                                 0x2
#define _RXB0SIDH_SID5_POSN                                 0x2
#define _RXB0SIDH_SID5_POSITION                             0x2
#define _RXB0SIDH_SID5_SIZE                                 0x1
#define _RXB0SIDH_SID5_LENGTH                               0x1
#define _RXB0SIDH_SID5_MASK                                 0x4
#define _RXB0SIDH_SID6_POSN                                 0x3
#define _RXB0SIDH_SID6_POSITION                             0x3
#define _RXB0SIDH_SID6_SIZE                                 0x1
#define _RXB0SIDH_SID6_LENGTH                               0x1
#define _RXB0SIDH_SID6_MASK                                 0x8
#define _RXB0SIDH_SID7_POSN                                 0x4
#define _RXB0SIDH_SID7_POSITION                             0x4
#define _RXB0SIDH_SID7_SIZE                                 0x1
#define _RXB0SIDH_SID7_LENGTH                               0x1
#define _RXB0SIDH_SID7_MASK                                 0x10
#define _RXB0SIDH_SID8_POSN                                 0x5
#define _RXB0SIDH_SID8_POSITION                             0x5
#define _RXB0SIDH_SID8_SIZE                                 0x1
#define _RXB0SIDH_SID8_LENGTH                               0x1
#define _RXB0SIDH_SID8_MASK                                 0x20
#define _RXB0SIDH_SID9_POSN                                 0x6
#define _RXB0SIDH_SID9_POSITION                             0x6
#define _RXB0SIDH_SID9_SIZE                                 0x1
#define _RXB0SIDH_SID9_LENGTH                               0x1
#define _RXB0SIDH_SID9_MASK                                 0x40
#define _RXB0SIDH_SID10_POSN                                0x7
#define _RXB0SIDH_SID10_POSITION                            0x7
#define _RXB0SIDH_SID10_SIZE                                0x1
#define _RXB0SIDH_SID10_LENGTH                              0x1
#define _RXB0SIDH_SID10_MASK                                0x80
#define _RXB0SIDH_RXB0SID3_POSN                             0x0
#define _RXB0SIDH_RXB0SID3_POSITION                         0x0
#define _RXB0SIDH_RXB0SID3_SIZE                             0x1
#define _RXB0SIDH_RXB0SID3_LENGTH                           0x1
#define _RXB0SIDH_RXB0SID3_MASK                             0x1
#define _RXB0SIDH_RXB0SID4_POSN                             0x1
#define _RXB0SIDH_RXB0SID4_POSITION                         0x1
#define _RXB0SIDH_RXB0SID4_SIZE                             0x1
#define _RXB0SIDH_RXB0SID4_LENGTH                           0x1
#define _RXB0SIDH_RXB0SID4_MASK                             0x2
#define _RXB0SIDH_RXB0SID5_POSN                             0x2
#define _RXB0SIDH_RXB0SID5_POSITION                         0x2
#define _RXB0SIDH_RXB0SID5_SIZE                             0x1
#define _RXB0SIDH_RXB0SID5_LENGTH                           0x1
#define _RXB0SIDH_RXB0SID5_MASK                             0x4
#define _RXB0SIDH_RXB0SID6_POSN                             0x3
#define _RXB0SIDH_RXB0SID6_POSITION                         0x3
#define _RXB0SIDH_RXB0SID6_SIZE                             0x1
#define _RXB0SIDH_RXB0SID6_LENGTH                           0x1
#define _RXB0SIDH_RXB0SID6_MASK                             0x8
#define _RXB0SIDH_RXB0SID7_POSN                             0x4
#define _RXB0SIDH_RXB0SID7_POSITION                         0x4
#define _RXB0SIDH_RXB0SID7_SIZE                             0x1
#define _RXB0SIDH_RXB0SID7_LENGTH                           0x1
#define _RXB0SIDH_RXB0SID7_MASK                             0x10
#define _RXB0SIDH_RXB0SID8_POSN                             0x5
#define _RXB0SIDH_RXB0SID8_POSITION                         0x5
#define _RXB0SIDH_RXB0SID8_SIZE                             0x1
#define _RXB0SIDH_RXB0SID8_LENGTH                           0x1
#define _RXB0SIDH_RXB0SID8_MASK                             0x20
#define _RXB0SIDH_RXB0SID9_POSN                             0x6
#define _RXB0SIDH_RXB0SID9_POSITION                         0x6
#define _RXB0SIDH_RXB0SID9_SIZE                             0x1
#define _RXB0SIDH_RXB0SID9_LENGTH                           0x1
#define _RXB0SIDH_RXB0SID9_MASK                             0x40
#define _RXB0SIDH_RXB0SID10_POSN                            0x7
#define _RXB0SIDH_RXB0SID10_POSITION                        0x7
#define _RXB0SIDH_RXB0SID10_SIZE                            0x1
#define _RXB0SIDH_RXB0SID10_LENGTH                          0x1
#define _RXB0SIDH_RXB0SID10_MASK                            0x80

// Register: RXB0SIDL
#define RXB0SIDL RXB0SIDL
extern volatile unsigned char           RXB0SIDL            __at(0xF62);
#ifndef _LIB_BUILD
asm("RXB0SIDL equ 0F62h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID16                  :1;
        unsigned EID17                  :1;
        unsigned                        :1;
        unsigned EXID                   :1;
        unsigned SRR                    :1;
        unsigned SID0                   :1;
        unsigned SID1                   :1;
        unsigned SID2                   :1;
    };
    struct {
        unsigned RXB0EID16              :1;
        unsigned RXB0EID17              :1;
        unsigned                        :1;
        unsigned RXB0EXID               :1;
        unsigned RXB0SRR                :1;
        unsigned RXB0SID0               :1;
        unsigned RXB0SID1               :1;
        unsigned RXB0SID2               :1;
    };
} RXB0SIDLbits_t;
