MikroElektronika/core_packages/PIC/XC8/def/PIC18F4680/mcu.h
extern volatile RXB0SIDLbits_t RXB0SIDLbits __at(0xF62);
// bitfield macros
#define _RXB0SIDL_EID16_POSN                                0x0
#define _RXB0SIDL_EID16_POSITION                            0x0
#define _RXB0SIDL_EID16_SIZE                                0x1
#define _RXB0SIDL_EID16_LENGTH                              0x1
#define _RXB0SIDL_EID16_MASK                                0x1
#define _RXB0SIDL_EID17_POSN                                0x1
#define _RXB0SIDL_EID17_POSITION                            0x1
#define _RXB0SIDL_EID17_SIZE                                0x1
#define _RXB0SIDL_EID17_LENGTH                              0x1
#define _RXB0SIDL_EID17_MASK                                0x2
#define _RXB0SIDL_EXID_POSN                                 0x3
#define _RXB0SIDL_EXID_POSITION                             0x3
#define _RXB0SIDL_EXID_SIZE                                 0x1
#define _RXB0SIDL_EXID_LENGTH                               0x1
#define _RXB0SIDL_EXID_MASK                                 0x8
#define _RXB0SIDL_SRR_POSN                                  0x4
#define _RXB0SIDL_SRR_POSITION                              0x4
#define _RXB0SIDL_SRR_SIZE                                  0x1
#define _RXB0SIDL_SRR_LENGTH                                0x1
#define _RXB0SIDL_SRR_MASK                                  0x10
#define _RXB0SIDL_SID0_POSN                                 0x5
#define _RXB0SIDL_SID0_POSITION                             0x5
#define _RXB0SIDL_SID0_SIZE                                 0x1
#define _RXB0SIDL_SID0_LENGTH                               0x1
#define _RXB0SIDL_SID0_MASK                                 0x20
#define _RXB0SIDL_SID1_POSN                                 0x6
#define _RXB0SIDL_SID1_POSITION                             0x6
#define _RXB0SIDL_SID1_SIZE                                 0x1
#define _RXB0SIDL_SID1_LENGTH                               0x1
#define _RXB0SIDL_SID1_MASK                                 0x40
#define _RXB0SIDL_SID2_POSN                                 0x7
#define _RXB0SIDL_SID2_POSITION                             0x7
#define _RXB0SIDL_SID2_SIZE                                 0x1
#define _RXB0SIDL_SID2_LENGTH                               0x1
#define _RXB0SIDL_SID2_MASK                                 0x80
#define _RXB0SIDL_RXB0EID16_POSN                            0x0
#define _RXB0SIDL_RXB0EID16_POSITION                        0x0
#define _RXB0SIDL_RXB0EID16_SIZE                            0x1
#define _RXB0SIDL_RXB0EID16_LENGTH                          0x1
#define _RXB0SIDL_RXB0EID16_MASK                            0x1
#define _RXB0SIDL_RXB0EID17_POSN                            0x1
#define _RXB0SIDL_RXB0EID17_POSITION                        0x1
#define _RXB0SIDL_RXB0EID17_SIZE                            0x1
#define _RXB0SIDL_RXB0EID17_LENGTH                          0x1
#define _RXB0SIDL_RXB0EID17_MASK                            0x2
#define _RXB0SIDL_RXB0EXID_POSN                             0x3
#define _RXB0SIDL_RXB0EXID_POSITION                         0x3
#define _RXB0SIDL_RXB0EXID_SIZE                             0x1
#define _RXB0SIDL_RXB0EXID_LENGTH                           0x1
#define _RXB0SIDL_RXB0EXID_MASK                             0x8
#define _RXB0SIDL_RXB0SRR_POSN                              0x4
#define _RXB0SIDL_RXB0SRR_POSITION                          0x4
#define _RXB0SIDL_RXB0SRR_SIZE                              0x1
#define _RXB0SIDL_RXB0SRR_LENGTH                            0x1
#define _RXB0SIDL_RXB0SRR_MASK                              0x10
#define _RXB0SIDL_RXB0SID0_POSN                             0x5
#define _RXB0SIDL_RXB0SID0_POSITION                         0x5
#define _RXB0SIDL_RXB0SID0_SIZE                             0x1
#define _RXB0SIDL_RXB0SID0_LENGTH                           0x1
#define _RXB0SIDL_RXB0SID0_MASK                             0x20
#define _RXB0SIDL_RXB0SID1_POSN                             0x6
#define _RXB0SIDL_RXB0SID1_POSITION                         0x6
#define _RXB0SIDL_RXB0SID1_SIZE                             0x1
#define _RXB0SIDL_RXB0SID1_LENGTH                           0x1
#define _RXB0SIDL_RXB0SID1_MASK                             0x40
#define _RXB0SIDL_RXB0SID2_POSN                             0x7
#define _RXB0SIDL_RXB0SID2_POSITION                         0x7
#define _RXB0SIDL_RXB0SID2_SIZE                             0x1
#define _RXB0SIDL_RXB0SID2_LENGTH                           0x1
#define _RXB0SIDL_RXB0SID2_MASK                             0x80

// Register: RXB0EIDH
#define RXB0EIDH RXB0EIDH
extern volatile unsigned char           RXB0EIDH            __at(0xF63);
#ifndef _LIB_BUILD
asm("RXB0EIDH equ 0F63h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID8                   :1;
        unsigned EID9                   :1;
        unsigned EID10                  :1;
        unsigned EID11                  :1;
        unsigned EID12                  :1;
        unsigned EID13                  :1;
        unsigned EID14                  :1;
        unsigned EID15                  :1;
    };
    struct {
        unsigned RXB0EID8               :1;
        unsigned RXB0EID9               :1;
        unsigned RXB0EID10              :1;
        unsigned RXB0EID11              :1;
        unsigned RXB0EID12              :1;
        unsigned RXB0EID13              :1;
        unsigned RXB0EID14              :1;
        unsigned RXB0EID15              :1;
    };
} RXB0EIDHbits_t;
extern volatile RXB0EIDHbits_t RXB0EIDHbits __at(0xF63);
// bitfield macros
#define _RXB0EIDH_EID8_POSN                                 0x0
#define _RXB0EIDH_EID8_POSITION                             0x0
#define _RXB0EIDH_EID8_SIZE                                 0x1
#define _RXB0EIDH_EID8_LENGTH                               0x1
#define _RXB0EIDH_EID8_MASK                                 0x1
#define _RXB0EIDH_EID9_POSN                                 0x1
#define _RXB0EIDH_EID9_POSITION                             0x1
#define _RXB0EIDH_EID9_SIZE                                 0x1
#define _RXB0EIDH_EID9_LENGTH                               0x1
#define _RXB0EIDH_EID9_MASK                                 0x2
#define _RXB0EIDH_EID10_POSN                                0x2
#define _RXB0EIDH_EID10_POSITION                            0x2
#define _RXB0EIDH_EID10_SIZE                                0x1
#define _RXB0EIDH_EID10_LENGTH                              0x1
#define _RXB0EIDH_EID10_MASK                                0x4
#define _RXB0EIDH_EID11_POSN                                0x3
#define _RXB0EIDH_EID11_POSITION                            0x3
#define _RXB0EIDH_EID11_SIZE                                0x1
#define _RXB0EIDH_EID11_LENGTH                              0x1
#define _RXB0EIDH_EID11_MASK                                0x8
#define _RXB0EIDH_EID12_POSN                                0x4
#define _RXB0EIDH_EID12_POSITION                            0x4
#define _RXB0EIDH_EID12_SIZE                                0x1
#define _RXB0EIDH_EID12_LENGTH                              0x1
#define _RXB0EIDH_EID12_MASK                                0x10
#define _RXB0EIDH_EID13_POSN                                0x5
#define _RXB0EIDH_EID13_POSITION                            0x5
#define _RXB0EIDH_EID13_SIZE                                0x1
#define _RXB0EIDH_EID13_LENGTH                              0x1
#define _RXB0EIDH_EID13_MASK                                0x20
#define _RXB0EIDH_EID14_POSN                                0x6
#define _RXB0EIDH_EID14_POSITION                            0x6
#define _RXB0EIDH_EID14_SIZE                                0x1
#define _RXB0EIDH_EID14_LENGTH                              0x1
#define _RXB0EIDH_EID14_MASK                                0x40
#define _RXB0EIDH_EID15_POSN                                0x7
#define _RXB0EIDH_EID15_POSITION                            0x7
#define _RXB0EIDH_EID15_SIZE                                0x1
#define _RXB0EIDH_EID15_LENGTH                              0x1
#define _RXB0EIDH_EID15_MASK                                0x80
#define _RXB0EIDH_RXB0EID8_POSN                             0x0
#define _RXB0EIDH_RXB0EID8_POSITION                         0x0
#define _RXB0EIDH_RXB0EID8_SIZE                             0x1
#define _RXB0EIDH_RXB0EID8_LENGTH                           0x1
#define _RXB0EIDH_RXB0EID8_MASK                             0x1
#define _RXB0EIDH_RXB0EID9_POSN                             0x1
#define _RXB0EIDH_RXB0EID9_POSITION                         0x1
#define _RXB0EIDH_RXB0EID9_SIZE                             0x1
#define _RXB0EIDH_RXB0EID9_LENGTH                           0x1
#define _RXB0EIDH_RXB0EID9_MASK                             0x2
#define _RXB0EIDH_RXB0EID10_POSN                            0x2
#define _RXB0EIDH_RXB0EID10_POSITION                        0x2
#define _RXB0EIDH_RXB0EID10_SIZE                            0x1
#define _RXB0EIDH_RXB0EID10_LENGTH                          0x1
#define _RXB0EIDH_RXB0EID10_MASK                            0x4
#define _RXB0EIDH_RXB0EID11_POSN                            0x3
#define _RXB0EIDH_RXB0EID11_POSITION                        0x3
#define _RXB0EIDH_RXB0EID11_SIZE                            0x1
#define _RXB0EIDH_RXB0EID11_LENGTH                          0x1
#define _RXB0EIDH_RXB0EID11_MASK                            0x8
#define _RXB0EIDH_RXB0EID12_POSN                            0x4
#define _RXB0EIDH_RXB0EID12_POSITION                        0x4
#define _RXB0EIDH_RXB0EID12_SIZE                            0x1
#define _RXB0EIDH_RXB0EID12_LENGTH                          0x1
#define _RXB0EIDH_RXB0EID12_MASK                            0x10
#define _RXB0EIDH_RXB0EID13_POSN                            0x5
#define _RXB0EIDH_RXB0EID13_POSITION                        0x5
#define _RXB0EIDH_RXB0EID13_SIZE                            0x1
#define _RXB0EIDH_RXB0EID13_LENGTH                          0x1
#define _RXB0EIDH_RXB0EID13_MASK                            0x20
#define _RXB0EIDH_RXB0EID14_POSN                            0x6
#define _RXB0EIDH_RXB0EID14_POSITION                        0x6
#define _RXB0EIDH_RXB0EID14_SIZE                            0x1
#define _RXB0EIDH_RXB0EID14_LENGTH                          0x1
#define _RXB0EIDH_RXB0EID14_MASK                            0x40
#define _RXB0EIDH_RXB0EID15_POSN                            0x7
#define _RXB0EIDH_RXB0EID15_POSITION                        0x7
#define _RXB0EIDH_RXB0EID15_SIZE                            0x1
#define _RXB0EIDH_RXB0EID15_LENGTH                          0x1
#define _RXB0EIDH_RXB0EID15_MASK                            0x80

